Industry_Text = (
"""
农林牧渔：种植业(种子、粮食种植、其他种植业、食用菌)、渔业(海洋捕捞、水产养殖)、林业Ⅱ(林业Ⅲ)、饲料(畜禽饲料、水产饲料、宠物食品)、农产品加工(果蔬加工、粮油加工、其他农产品加工)、养殖业(生猪养殖、肉鸡养殖、其他养殖)、动物保健Ⅱ(动物保健Ⅲ)、农业综合Ⅱ(农业综合Ⅲ)；
基础化工：化学原料(纯碱、氯碱、无机盐、其他化学原料、煤化工、钛白粉)、化学制品(涂料油墨、民爆制品、纺织化学制品、其他化学制品、氟化工、聚氨酯、食品及饲料添加剂、有机硅、胶黏剂及胶带)、化学纤维(涤纶、粘胶、其他化学纤维、氨纶、锦纶)、塑料(其他塑料制品、改性塑料、合成树脂、膜材料)、橡胶(其他橡胶制品、炭黑、橡胶助剂)、农化制品(氮肥、磷肥及磷化工、农药、钾肥、复合肥)、非金属材料Ⅱ(非金属材料Ⅲ)；
钢铁：冶钢原料(铁矿石、冶钢辅料)、普钢(长材、板材、钢铁管材)、特钢Ⅱ(特钢Ⅲ)；
有色金属：金属新材料(其他金属新材料、磁性材料)、工业金属(铝、铜、铅锌)、贵金属(黄金、白银)、小金属(稀土、钨、其他小金属、钼)、能源金属(钴、镍、锂)；
电子：半导体(分立器件、半导体材料、数字芯片设计、模拟芯片设计、集成电路制造、集成电路封测、半导体设备)、元件(印制电路板、被动元件)、光学光电子(面板、LED、光学元件)、其他电子Ⅱ(其他电子Ⅲ)、消费电子(品牌消费电子、消费电子零部件及组装)、电子化学品Ⅱ(电子化学品Ⅲ)；
汽车：汽车零部件(车身附件及饰件、底盘与发动机系统、轮胎轮毂、其他汽车零部件、汽车电子电气系统)、汽车服务(汽车经销商、汽车综合服务)、摩托车及其他(其他运输设备、摩托车)、乘用车(电动乘用车、综合乘用车)、商用车(商用载货车、商用载客车)；
家用电器：白色家电(空调、冰洗)、黑色家电(彩电、其他黑色家电)、小家电(厨房小家电、清洁小家电、个护小家电)、厨卫电器(厨房电器、卫浴电器)、照明设备Ⅱ(照明设备Ⅲ)、家电零部件Ⅱ(家电零部件Ⅲ)、其他家电Ⅱ(其他家电Ⅲ)；
食品饮料：食品加工(肉制品、其他食品、预加工食品、保健品)、白酒Ⅱ(白酒Ⅲ)、非白酒(啤酒、其他酒类)、饮料乳品(软饮料、乳品)、休闲食品(零食、烘焙食品、熟食)、调味发酵品Ⅱ(调味发酵品Ⅲ)；
纺织服饰：纺织制造(棉纺、印染、辅料、其他纺织、纺织鞋类制造)、服装家纺(鞋帽及其他、家纺、运动服装、非运动服装)、饰品(钟表珠宝、多品类奢侈品、其他饰品)；
轻工制造：造纸(大宗用纸、特种纸)、包装印刷(印刷、金属包装、塑料包装、纸包装、综合包装)、家居用品(瓷砖地板、成品家居、定制家居、卫浴制品、其他家居用品)、文娱用品(文化用品、娱乐用品)；
医药生物：化学制药(原料药、化学制剂)、中药Ⅱ(中药Ⅲ)、生物制品(血液制品、疫苗、其他生物制品)、医药商业(医药流通、线下药店、互联网药店)、医疗器械(医疗设备、医疗耗材、体外诊断)、医疗服务(诊断服务、医疗研发外包、医院、其他医疗服务)；
公用事业：电力(火力发电、水力发电、热力服务、光伏发电、风力发电、核力发电、其他能源发电、电能综合服务)、燃气Ⅱ(燃气Ⅲ)；
交通运输：物流(原材料供应链服务、中间产品及消费品供应链服务、快递、跨境物流、仓储物流、公路货运)、铁路公路(高速公路、公交、铁路运输)、航空机场(航空运输、机场)、航运港口(航运、港口)；
房地产：房地产开发(住宅开发、商业地产、产业地产)、房地产服务(物业管理、房产租赁经纪、房地产综合服务)；
商贸零售：贸易Ⅱ(贸易Ⅲ)、一般零售(百货、超市、多业态零售、商业物业经营)、专业连锁Ⅱ(专业连锁Ⅲ)、互联网电商(综合电商、跨境电商、电商服务)、旅游零售Ⅱ(旅游零售Ⅲ)；
社会服务：体育Ⅱ(体育Ⅲ)、本地生活服务Ⅱ(本地生活服务Ⅲ)、专业服务(人力资源服务、检测服务、会展服务、其他专业服务)、酒店餐饮(酒店、餐饮)、旅游及景区(博彩、人工景区、自然景区、旅游综合)、教育(学历教育、培训教育、教育运营及其他)；
银行：国有大型银行Ⅱ(国有大型银行Ⅲ)、股份制银行Ⅱ(股份制银行Ⅲ)、城商行Ⅱ(城商行Ⅲ)、农商行Ⅱ(农商行Ⅲ)、其他银行Ⅱ(其他银行Ⅲ)；
非银金融：证券Ⅱ(证券Ⅲ)、保险Ⅱ(保险Ⅲ)、多元金融(金融控股、期货、信托、租赁、金融信息服务、资产管理、其他多元金融)；
综合：综合Ⅱ(综合Ⅲ)；
建筑材料：水泥(水泥制造、水泥制品)、玻璃玻纤(玻璃制造、玻纤制造)、装修建材(耐火材料、管材、其他建材、防水材料、涂料)；
建筑装饰：房屋建设Ⅱ(房屋建设Ⅲ)、装修装饰Ⅱ(装修装饰Ⅲ)、基础建设(基建市政工程、园林工程)、专业工程(钢结构、化学工程、国际工程、其他专业工程)、工程咨询服务Ⅱ(工程咨询服务Ⅲ)；
电力设备：电机Ⅱ(电机Ⅲ)、其他电源设备Ⅱ(综合电力设备商、火电设备、其他电源设备Ⅲ)、光伏设备(硅料硅片、光伏电池组件、逆变器、光伏辅材、光伏加工设备)、风电设备(风电整机、风电零部件)、电池(锂电池、电池化学品、锂电专用设备、燃料电池、蓄电池及其他电池)、电网设备(输变电设备、配电设备、电网自动化设备、电工仪器仪表、线缆部件及其他)；
机械设备：通用设备(机床工具、磨具磨料、制冷空调设备、其他通用设备、仪器仪表、金属制品)、专用设备(能源及重型设备、楼宇设备、纺织服装设备、农用机械、印刷包装机械、其他专用设备)、轨交设备Ⅱ(轨交设备Ⅲ)、工程机械(工程机械整机、工程机械器件)、自动化设备(机器人、工控设备、激光设备、其他自动化设备)；
国防军工：航天装备Ⅱ(航天装备Ⅲ)、航空装备Ⅱ(航空装备Ⅲ)、地面兵装Ⅱ(地面兵装Ⅲ)、航海装备Ⅱ(航海装备Ⅲ)、军工电子Ⅱ(军工电子Ⅲ)；
计算机：计算机设备(安防设备、其他计算机设备)、IT服务Ⅱ(IT服务Ⅲ)、软件开发(垂直应用软件、横向通用软件)；
传媒：游戏Ⅱ(游戏Ⅲ)、广告营销(营销代理、广告媒体)、影视院线(影视动漫制作、院线)、数字媒体(视频媒体、音频媒体、图片媒体、门户网站、文字媒体、其他数字媒体)、社交Ⅱ(社交Ⅲ)、出版(教育出版、大众出版、其他出版)、电视广播Ⅱ(电视广播Ⅲ)；
通信：通信服务(电信运营商、通信工程及服务、通信应用增值服务)、通信设备(通信网络设备及器件、通信线缆及配套、通信终端及配件、其他通信设备)；
煤炭：煤炭开采(动力煤、焦煤)、焦炭Ⅱ(焦炭Ⅲ)；
石油石化：油气开采Ⅱ(油气开采Ⅲ)、油服工程(油田服务、油气及炼化工程)、炼化及贸易(炼油化工、油品石化贸易、其他石化)；
环保：环境治理(大气治理、水务及水治理、固废治理、综合环境治理)、环保设备Ⅱ(环保设备Ⅲ)；
美容护理：个护用品(生活用纸、洗护用品)、化妆品(化妆品制造及其他、品牌化妆品)、医疗美容(医美耗材、医美服务)；
"""
).strip()

System_Prompt = (
"""
你是一个行业研究顾问，现有中国A股行业分类如下，格式：一级：二级(三级)：

{Industry_Text}

以下这是为{DATE}{Weekday}的{Size}人民日报广告内容，请对其做出行业分类（格式为"一级-二级-三级"或"一级-二级"或"一级"，每个级别严格来自于上述分类；如有多个分类，不同分类使用半角逗号隔开）；
并分辨其广告类型（公益广告、商业广告等），加上解读内容（包括内容总结、为什么它有资格出现在人民日报、为什么在那个时间发此{Size}广告、体现了什么政策风向、暗示着行业的哪些发展动向、对这个行业的股市影响是什么。注意，回答言简意赅，确保客观和一针见血)；
并加上强调的地区（例如：北京市、深圳市、临武县、浙江省等，必须是省级以下；如果有多个地区，则不同地区使用半角逗号隔开；如果没有强调特定的地区，则填上空字符串""）
输出格式如下：严格限定为以下Python字典格式和键值，例为：
{{"industry": "计算机-IT服务Ⅱ-IT服务Ⅲ,传媒-游戏Ⅱ", "ad_type": "商业广告", "region": "北京市,天津市", "analysis": ""}}

{AD}
"""
).strip()